IdeaRS.OpenModel.Message.MessageNumber
Message numbers

IdeaRS.OpenModel.Message.MessageNumber.Unspecified
Unspecified

IdeaRS.OpenModel.Message.MessageNumber.Information
General information

IdeaRS.OpenModel.Message.MessageNumber.Warning
General warning

IdeaRS.OpenModel.Message.MessageNumber.Error
General error

IdeaRS.OpenModel.Message.MessageNumber.Reserved
Reserved

IdeaRS.OpenModel.Message.MessageNumber.WarnNoPropertyInData
No equivalent property in the Data object

IdeaRS.OpenModel.Message.MessageNumber.WarnValueOutOfRange
The value is out of the range.

IdeaRS.OpenModel.Message.MessageNumber.WarnCurveCount
The number of points of the curve is exceed 100.

IdeaRS.OpenModel.Message.MessageNumber.WarnReinforcementBarsCollision
Some of bars in the reinforced cross-section are in collision.

IdeaRS.OpenModel.Message.MessageNumber.ErrNoOpenObject
No Open Model object.

IdeaRS.OpenModel.Message.MessageNumber.ErrDataObjectNotCreated
The Data object in Data Model was not created. Internal error.

IdeaRS.OpenModel.Message.MessageNumber.ErrNoObjectInOpenModel
No Open Model object in the Idea Open Model.

IdeaRS.OpenModel.Message.MessageNumber.ErrNoReferenceObjectInOpenModel
No referenced Open Model object in the Idea Open Model.

IdeaRS.OpenModel.Message.MessageNumber.ErrNoEquivalentObjectInDataModel
No equivalent Data object in the Data Model.

IdeaRS.OpenModel.Message.MessageNumber.ErrNoCrossSectionParameter
No cross-section parameter in the Open Model Cross-section

IdeaRS.OpenModel.Message.MessageNumber.ErrBoltsTooClose
Bolts are too close to each other.

IdeaRS.OpenModel.Message.MessageNumber.ErrBoltsTooCloseEdge
Bolts are too close to plate edge or outside of the connected plate.

IdeaRS.OpenModel.Message.MessageNumber.ErrContactsAngle
Angle of plates in contact is out of limit (sin(alfa) > 0.001).

IdeaRS.OpenModel.Message.MessageNumber.ErrIncorrentMaterialE
Incorrect material E-modulus.

IdeaRS.OpenModel.Message.MessageNumber.ErrIncorrectMaterialEGP
Material properties don't satisfy the condition: "(1.0 - E / (2.0 * (1.0 + Poisson) * G)) < 0.01".

IdeaRS.OpenModel.Message.MessageNumber.ErrPreloadedBoltGrade
Bolt grade is not allowed in slip-resistant joints.

IdeaRS.OpenModel.Message.MessageNumber.ErrValueOutOfRange
The value is out of the range.

IdeaRS.OpenModel.Message.MessageNumber.ErrCurveZeroPoint
The curve doesn't contain the point (0, 0).

IdeaRS.OpenModel.Message.MessageNumber.ErrCurveFunction
The curve isn't a function.

IdeaRS.OpenModel.Message.MessageNumber.ErrCurveDecreaseFunction
The curve mustn't be a decrease function.

IdeaRS.OpenModel.Message.MessageNumber.ErrCurveDerivation
The curve derivation is out of range.

IdeaRS.OpenModel.Message.MessageNumber.ErrCurveNotSet
The curve isn't set.

IdeaRS.OpenModel.Message.MessageNumber.ErrValidPolyline
The geometry of the polyline is not valid. The segments are not continuous or they have a different orientation.